# 5. Selecting Subsets of Data from DataFrames with `.loc`

### Objectives

+ `.loc` can select rows, columns, or rows and columns simultaneously
+ `.loc` selects only by **label**

# Subset selection with `.loc`
The **`.loc`** indexer selects data in a different manner than *just the brackets*. We must learn its set of rules.

## Simultaneous row and column subset selection with `.loc`
**`.loc`** can select rows and columns simultaneously. You cannot do this with *just the brackets*. 

This is done by separating the row and column selections with a **comma**. The selection will look something like this:

```
df.loc[rows, cols]
```

## `.loc` only selects data by LABEL

Very importantly, **`.loc`** only selects data by the **LABEL** of the rows and columns. You must provide **`.loc`** with the label of the rows and/or columns you would like to select.

## Select two rows and three columns with .loc
If we wanted to select the rows **`Dean`** and **`Cornelia`** along with the columns **`age`**, **`state`**, and **`score`** we would do this:

In [2]:
import pandas as pd
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [ ]:
rows = ['Dean', 'Cornelia']
cols = ['age', 'state', 'score']

df.loc[rows, cols]

## The possible types of selections for `.loc`
Row or column selections can be any of the following:

* A single label
* A list of labels
* A slice with labels

We can use any of these three for either row or column selections with `.loc.`

### Select two rows and a single column:
Here we use a list for the rows and string for the column. The row selection is **`['Dean', 'Aaron']`** and the column selection is **`food`**. Note how this returns a Series since we are selecting exactly a single column.

In [ ]:
rows = ['Dean', 'Aaron']
cols = 'food'

df.loc[rows, cols]

# Use slice notation to select a range of rows
We have seen slice notation when working with Python lists. This same notation is allowed with DataFrames. Let's choose all of the rows from Jane to Penelope with slice notation along with the columns state and color.

In [ ]:
cols = ['state', 'color']

df.loc['Jane':'Penelope', cols]

## Slice notation only works in brackets attached to the object
Python only allows us to use slice notation within the brackets that are attached to an object. If we try and assign slice notation outside of this, we will get a syntax error like we do below.

In [ ]:
rows = ['Jane':'Penelope']

## Use the `slice` function to separate out the selection in a different line
There is a built-in `slice` function that you can use to assign your selection to a variable. It takes the same three values **start**, **stop**, and **step**, but this time as function parameters.

In [ ]:
rows = slice('Jane', 'Penelope')
cols = ['state', 'color']

df.loc[rows, cols]

### Slice both the rows and columns

In [ ]:
df.loc[:'Dean', 'height':]

Use `None` to denote an empty part of the slice.

In [ ]:
rows = slice(None, 'Dean')
cols = slice('height', None)

df.loc[rows, cols]

## Slices with `.loc` are inclusive of the stop value
Notice that the stop value is included in the returned DataFrame. When slicing Python lists, the last element is **excluded**.

# Use slice notation or the slice function?
Almost no one uses the `slice` function, so you will probably want to use slice notation. That said, the slice function does help separate the row and column selection into their own lines of code.

### Selecting all of the rows and some columns
It is possible to select all of the rows by using a single colon. Here, we select all of the rows and two of the columns.

In [ ]:
cols = ['food', 'color']
df.loc[:, cols]

In [ ]:
rows = slice(None)
cols = ['food', 'color']

df.loc[rows, cols]

## The above is not necessary! Use *just the brackets*
You would never see two columns with all the rows selected like that. This is exactly what *just the brackets* are built for.

In [ ]:
cols = ['food', 'color']
df[cols]

### A single colon is slice notation for select all
That single colon might be intimidating but it is technically slice notation that selects all items. See the following example with a list:

In [ ]:
a_list = [1, 2, 3, 4, 5, 6]
a_list[:]

## Use a single colon to select all the columns

In [ ]:
rows = ['Penelope','Cornelia']
df.loc[rows, :]

### The above is usually shortened
By default, Pandas will select all of the columns if you only provide a row selection. Providing the colon is not necessary and the following will do the same:

In [ ]:
rows = ['Penelope','Cornelia']
df.loc[rows]

## Use slice notation to select a range of rows with all of the columns
Similary, we can slice from Niko through Dean while selecting all of the columns. We do not provide a specific column selection. By default, Pandas returns all of the columns.

In [ ]:
df.loc['Niko':'Dean']

## Other slicing examples
You can slice in a variety of ways such as taking every other row by setting the step size to 2:

In [ ]:
df.loc['Niko':'Christina':2]

With the `slice` function.

In [ ]:
rows = slice('Niko', 'Christina', 2)
df.loc[rows]

Omitting the start value to include all rows until the stop value:

In [ ]:
df.loc[:'Penelope']

Use `None` to represent a missing component of the slice.

In [ ]:
rows = slice(None, 'Penelope')
df.loc[rows]

Omitting the stop value to keep all rows after the start value:

In [ ]:
df.loc['Aaron':]

In [ ]:
rows = slice('Aaron', None)
df.loc[rows]

## Select a single row and a single column
This returns a scalar value and NOT a DataFrame or Series

In [ ]:
rows = 'Jane'
cols = 'state'
df.loc[rows, cols]

## Select a single row as a Series with `.loc`
The `.loc` indexer will return a single row as a Series when given a single row label. Let's select the row for Niko. Notice that the column names have now become index labels.

In [ ]:
df.loc['Niko']

# Is this confusing?
Think about why this output may be confusing.

# Summary of `.loc`
* Only uses labels
* Can select rows and columns simultaneously
* Selection can be a single label, a list of labels or a slice of labels
* Put a comma between row and column selections

# Exercises

### Problem 1
<span  style="color:green; font-size:16px">Read in the movie dataset and set the title column as the index. Select all columns for the movie 'The Dark Knight Rises'.</span>

In [39]:
import pandas as pd
movie_df = pd.read_csv('../data/movie.csv', index_col='title')
movie_df.head(3)

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,...,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
Avatar,2009.0,Color,PG-13,178.0,James Cameron,0.0,CCH Pounder,1000.0,Joel David Moore,936.0,...,855.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,723.0,886204,avatar|future|marine|native|paraplegic,English,USA,237000000.0,7.9
Pirates of the Caribbean: At World's End,2007.0,Color,PG-13,169.0,Gore Verbinski,563.0,Johnny Depp,40000.0,Orlando Bloom,5000.0,...,1000.0,309404152.0,Action|Adventure|Fantasy,302.0,471220,goddess|marriage ceremony|marriage proposal|pi...,English,USA,300000000.0,7.1
Spectre,2015.0,Color,PG-13,148.0,Sam Mendes,0.0,Christoph Waltz,11000.0,Rory Kinnear,393.0,...,161.0,200074175.0,Action|Adventure|Thriller,602.0,275868,bomb|espionage|sequel|spy|terrorist,English,UK,245000000.0,6.8

In [42]:
movie_df.loc['The Dark Knight Rises']

year                                                            2012
color                                                          Color
content_rating                                                 PG-13
duration                                                         164
director_name                                      Christopher Nolan
director_fb                                                    22000
actor1                                                     Tom Hardy
actor1_fb                                                      27000
actor2                                                Christian Bale
actor2_fb                                                      23000
actor3                                          Joseph Gordon-Levitt
actor3_fb                                                      23000
gross                                                    4.48131e+08
genres                                               Action|Thriller
num_reviews                                                      813
num_voted_users                                              1144337
plot_keywords      deception|imprisonment|lawlessness|police offi...
language                                                     English
country                                                          USA
budget                                                       2.5e+08
imdb_score                                                       8.5
Name: The Dark Knight Rises, dtype: object

In [43]:
movie_df.loc[['The Dark Knight Rises']]

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,...,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
The Dark Knight Rises,2012.0,Color,PG-13,164.0,Christopher Nolan,22000.0,Tom Hardy,27000.0,Christian Bale,23000.0,...,23000.0,448130642.0,Action|Thriller,813.0,1144337,deception|imprisonment|lawlessness|police offi...,English,USA,250000000.0,8.5

### Problem 2
<span  style="color:green; font-size:16px">Select all columns for the movies 'Tangled' and 'Avatar'.</span>

In [51]:
rows = ['Tangled', 'Avatar']
movie_df.loc[rows]

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,...,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
Tangled,2010.0,Color,PG,100.0,Nathan Greno,15.0,Brad Garrett,799.0,Donna Murphy,553.0,...,284.0,200807262.0,Adventure|Animation|Comedy|Family|Fantasy|Musi...,324.0,294810,17th century|based on fairy tale|disney|flower...,English,USA,260000000.0,7.8
Avatar,2009.0,Color,PG-13,178.0,James Cameron,0.0,CCH Pounder,1000.0,Joel David Moore,936.0,...,855.0,760505847.0,Action|Adventure|Fantasy|Sci-Fi,723.0,886204,avatar|future|marine|native|paraplegic,English,USA,237000000.0,7.9

### Problem 3
<span  style="color:green; font-size:16px">What year was 'Tangled' and 'Avatar' made and what was their IMBD scores?</span>

In [52]:
cols = ['year', 'imdb_score']
movie_df.loc[rows, cols]

           year  imdb_score
title
Tangled  2010.0         7.8
Avatar   2009.0         7.9

### Problem 4
<span  style="color:green; font-size:16px">Can you tell what the data type of the `year` column is by just looking at its values?</span>

In [57]:
# Turn this into a markdown cell and write your answer here
# float because is decimal

### Problem 5
<span  style="color:green; font-size:16px">Use a single method to output the data type and number of non-missing values of `year`. Is it missing any?</span>

In [58]:
movie_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4916 entries, Avatar to My Date with Drew
Data columns (total 21 columns):
year               4810 non-null float64
color              4897 non-null object
content_rating     4616 non-null object
duration           4901 non-null float64
director_name      4814 non-null object
director_fb        4814 non-null float64
actor1             4909 non-null object
actor1_fb          4909 non-null float64
actor2             4903 non-null object
actor2_fb          4903 non-null float64
actor3             4893 non-null object
actor3_fb          4893 non-null float64
gross              4054 non-null float64
genres             4916 non-null object
num_reviews        4867 non-null float64
num_voted_users    4916 non-null int64
plot_keywords      4764 non-null object
language           4904 non-null object
country            4911 non-null object
budget             4432 non-null float64
imdb_score         4916 non-null float64
dtypes: float64(10), int64(1), object(10)
memory usage: 1004.9+ KB

### Problem 6
<span  style="color:green; font-size:16px">Select every 100th movie between 'Tangled' and 'Forrest Gump'. Why doesn't 'Forrest Gump' appear in the results?</span>

In [68]:
movie_df.loc['Tangled':'Forrest Gump':100].head(5)

,year,color,content_rating,duration,director_name,director_fb,actor1,actor1_fb,actor2,actor2_fb,...,actor3_fb,gross,genres,num_reviews,num_voted_users,plot_keywords,language,country,budget,imdb_score
title,,,,,,,,,,,,,,,,,,,,,
Tangled,2010.0,Color,PG,100.0,Nathan Greno,15.0,Brad Garrett,799.0,Donna Murphy,553.0,...,284.0,200807262.0,Adventure|Animation|Comedy|Family|Fantasy|Musi...,324.0,294810,17th century|based on fairy tale|disney|flower...,English,USA,260000000.0,7.8
Shrek the Third,2007.0,Color,PG,93.0,Chris Miller,50.0,Justin Timberlake,3000.0,Eric Idle,795.0,...,692.0,320706665.0,Adventure|Animation|Comedy|Family|Fantasy,227.0,211971,disney spoof|fairy tale|prince|princess|tough guy,English,USA,160000000.0,6.1
X-Men 2,2003.0,Color,PG-13,134.0,Bryan Singer,0.0,Hugh Jackman,20000.0,Bruce Davison,505.0,...,346.0,214948780.0,Action|Adventure|Fantasy|Sci-Fi|Thriller,289.0,405973,mutant|prison|professor|school|x men,English,Canada,110000000.0,7.5
Cloud Atlas,2012.0,Color,R,172.0,Tom Tykwer,670.0,Tom Hanks,15000.0,Jim Sturgess,5000.0,...,1000.0,27098580.0,Drama|Sci-Fi,511.0,284825,composer|future|letter|nonlinear timeline|nurs...,English,Germany,102000000.0,7.5
Divergent,2014.0,Color,PG-13,139.0,Neil Burger,168.0,Kate Winslet,14000.0,Theo James,5000.0,...,1000.0,150832203.0,Adventure|Mystery|Sci-Fi,459.0,341058,army|brother sister relationship|dystopia|fath...,English,USA,85000000.0,6.7

## During class

* its case sensitive
* just select data by the label not by the integer index
* simultaneos selection (single label, list of labels, slice with labels)

In [69]:
import pandas as pd
df = pd.read_csv('../data/sample_data.csv', index_col=0)
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [3]:
df

          state  color    food  age  height  score
Jane         NY   blue   Steak   30     165    4.6
Niko         TX  green    Lamb    2      70    8.3
Aaron        FL    red   Mango   12     120    9.0
Penelope     AL  white   Apple    4      80    3.3
Dean         AK   gray  Cheese   32     180    1.8
Christina    TX  black   Melon   33     172    9.5
Cornelia     TX    red   Beans   69     150    2.2

In [4]:
rows = ['Dean', 'Niko']
cols = ['state', 'score', 'color']

In [8]:
df.loc[rows, cols] #loc can do simultaneos cols and rows selection .loc[rows,cols]

     state  score  color
Dean    AK    1.8   gray
Niko    TX    8.3  green

In [9]:
rows = ['Dean', 'Niko']
cols = 'state'

In [11]:
df.loc[rows,cols] #return a series because just have one dimension data (one column)

Dean    AK
Niko    TX
Name: state, dtype: object

In [13]:
rows = 'Niko'
cols = ['state', 'score', 'color']

In [15]:
df.loc[rows,cols] #return a series 'transpose the data to vertical'

state       TX
score      8.3
color    green
Name: Niko, dtype: object

In [17]:
df.loc['Niko', ['state','score','color']] #another way to write

state       TX
score      8.3
color    green
Name: Niko, dtype: object

In [19]:
df.loc['Niko', 'score']

8.3

In [23]:
df.loc['Niko':'Christina', cols] 
#slice notation [start:stop:step] - it is inclusive in this case because we are given an exactly value

          state  score  color
Niko         TX    8.3  green
Aaron        FL    9.0    red
Penelope     AL    3.3  white
Dean         AK    1.8   gray
Christina    TX    9.5  black

In [27]:
df.loc[:, cols] 
#keep all the rows and select the columns - do not need to use slice notation because is including all the rows

          state  score  color
Jane         NY    4.6   blue
Niko         TX    8.3  green
Aaron        FL    9.0    red
Penelope     AL    3.3  white
Dean         AK    1.8   gray
Christina    TX    9.5  black
Cornelia     TX    2.2    red

In [29]:
df[cols] #this would be what should be used

          state  score  color
Jane         NY    4.6   blue
Niko         TX    8.3  green
Aaron        FL    9.0    red
Penelope     AL    3.3  white
Dean         AK    1.8   gray
Christina    TX    9.5  black
Cornelia     TX    2.2    red

In [31]:
df.loc['Niko':'Dean','food':] #slicing in both

            food  age  height  score
Niko        Lamb    2      70    8.3
Aaron      Mango   12     120    9.0
Penelope   Apple    4      80    3.3
Dean      Cheese   32     180    1.8

In [32]:
df.loc['Niko':'Dean', :]

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [34]:
df.loc['Niko':'Dean'] #shortcut

         state  color    food  age  height  score
Niko        TX  green    Lamb    2      70    8.3
Aaron       FL    red   Mango   12     120    9.0
Penelope    AL  white   Apple    4      80    3.3
Dean        AK   gray  Cheese   32     180    1.8

In [36]:
df.loc['Aaron', :]

state        FL
color       red
food      Mango
age          12
height      120
score         9
Name: Aaron, dtype: object